export type ChatMessage = {
  text: string;
  from: "user" | "bot";
};

export const fakeQuestions: string[] = [
  "شو أفضل منطقة للاستثمار؟",
  "في شقق للبيع بسعر مناسب؟",
  "كم متوسط الأسعار بسراقب؟",
  "بدي بيت للإيجار",
];

export const fakeResponses: Record<string, string> = {
  "شو أفضل منطقة للاستثمار؟":
    "أفضل المناطق حالياً هي مركز سراقب والمناطق القريبة من الطرق الرئيسية.",

  "في شقق للبيع بسعر مناسب؟":
    "نعم، لدينا شقق تبدأ من 25,000$ حسب الموقع والمساحة.",

  "كم متوسط الأسعار بسراقب؟":
    "متوسط الأسعار يتراوح بين 20,000$ و 80,000$ حسب العقار.",

  "بدي بيت للإيجار": "متوفر بيوت للإيجار تبدأ من 150$ شهرياً.",
};
